smoke-perf-test.yml
execution:
- concurrency: 30
  ramp-up: 10s
  hold-for: 10s
  scenario: smoke-test

scenarios:
  smoke-test:
    requests:
      - https://www.demoblaze.com/

modules:
  blazemeter:
    token: e84cf576a5341750fddf1c32:4179b3afec065e9670abbb227da496b5c0ad13c140c083226ed32850d23466ea85607d7d      

reporting:
- module: passfail
  criteria:
  - p95<1500ms, stop as failed
  - rc4??>20% for 1m, stop as failed

- module: blazemeter
  report-name: Jenkins Build 1
  test: Taurus Demo
  project: Taurus Tests Group
  upload-artifacts: true  # upload artifacts when test is finished